channel395/rans2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.02;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // #includeFunc fieldAverage(U, p, prime2Mean = yes)

    // #includeFunc uniform
    // (
    //     fieldType = volScalarField,
    //     field = half,
    //     dimensions = [0 0 0 0 0 0 0],
    //     value = 0.5
    // )

    // #includeFunc mag(UPrime2Mean)

    // #includeFunc multiply(half, mag(UPrime2Mean), result = k)

    #includeFunc graphLayerAverage
    (
        name = layerAverage,
        patches = (bottomWall),
        axis = y,
        symmetric = yes,
        fields=(k,omega,U)
    );
}

// ************************************************************************* //
